Autodesk.Revit.DB.ExportLineweightInfo.DestinationLineweightName
The destination lineweight name (the name of the line weight in the exported format)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo.#ctor(System.String)
Constructs a new ExportLineweightInfo using the destination line weight name as input.
destinationLineweightName:
The destination line weight name (the name of the line weight in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo.#ctor(Autodesk.Revit.DB.ExportLineweightInfo)
Constructs a new copy of the input ExportLineweightInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014